Revit 2027 API
ElementMulticategoryFilter(ICollection<ElementId>) Constructor
 Constructs a new instance of a filter to find elements whose category matches any of a given set of categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementMulticategoryFilter(
	ICollection<ElementId> categoryIds
)
Public Sub New (
	categoryIds As ICollection(Of ElementId)
)
public:
ElementMulticategoryFilter(
	ICollection<ElementId^>^ categoryIds
)
new :
        categoryIds : ICollection<ElementId> -> ElementMulticategoryFilter
Parameters
categoryIds ICollection<ElementId>
 The category ids to match.
Exceptions
Exception | Condition
ArgumentException |  One or more categories was not valid for filtering.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementMulticategoryFilter Class
ElementMulticategoryFilter Overload
Autodesk.Revit.DB Namespace